cases/submerged/linear_z_pos/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	format		ascii;
	class		volScalarField;
	object		nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions	[0 2 -1 0 0 0 0];

internalField	uniform 0.0001;

boundaryField
{
	minX
	{
		type	nutUSpaldingWallFunction;
		value	$internalField;
	}

	maxX
	{
		type	nutUSpaldingWallFunction;
		value	$internalField;
	}
    
	minY
	{
		type	nutUSpaldingWallFunction;
		value	$internalField;
	}

	maxY
	{
		type	nutUSpaldingWallFunction;
		value	$internalField;
	}
    
    	minZ
	{
		type	calculated;
		value	$internalField;
	}

	maxZ
	{
		type	calculated;
		value	$internalField;
	}
    
	stlsurface
	{
		type	nutUSpaldingWallFunction;
		value	$internalField;
	}
}

